[
    {
    "titulo": "A Banalização da Saúde Mental e a Luta Antimanicomial",
    "resumo": "A banalização da saúde mental está como normalizada na nossa sociedade e isso, nos casos de fatos pessoais alheios (não descritos ou definidos) que poderiam ajudar quem está nestes problemas. Sendo assim, a farmacoterapia pode ajudar, mas mantê-la até o fim, isso poderia custar vidas? Não deveríamos ter uma abordagem diferente? A terapia eletroconvulsiva deveria ser de primeira opção ou segunda? Será que vai existir uma segunda, terceira ou quarta opção? A saúde está lançada sobre a sorte? A vida alheia importa?.",
    "link": "./paginas/outroartigosoficialwzzm/areformapsiquiatraeaect.html"
  },
  {
    "titulo": "Saúde Mental na Adolescência: Quando Procurar Ajuda e Como os Pais Podem Apoiar",
    "resumo": "A adolescência é um período de intensas mudanças emocionais e físicas, tornando os jovens mais vulneráveis a transtornos de saúde mental.",
    "link": "./paginas/outroartigosoficialwzzm/not6525a.html"
  },
  {
    "titulo": "Clínica e Cotidiano: O CAPS como Dispositivo de Desinstitucionalização",
    "resumo": "O presente artigo discute a importância dos Centros de Atenção Psicossocial (CAPS) como dispositivos centrais na efetivação da política de desinstitucionalização em saúde mental no Brasil. Analisando a trajetória de vinte anos desde a criação do primeiro CAPS, os autores argumentam que esses serviços devem ser compreendidos fundamentalmente como um modo de operar o cuidado, e não apenas como estabelecimentos de saúde.",
    "link": "./paginas/outroartigosoficialwzzm/artigocaps.html"
  },
  {
    "titulo": "Franco Basaglia e a Transformação da Psiquiatria: Da Desinstitucionalização à Liberdade Terapêutica",
    "resumo": "Nascido em Veneza em 1924, Franco Basaglia provinha de uma família abastada.1 No entanto, sua participação em atividades antifascistas durante a Segunda Guerra Mundial resultou em sua prisão, uma experiência que marcou profundamente suas opiniões sobre o confinamento institucional e a privação de liberdade.",
    "link": "./paginas/artigosgerados/info.html"
  },
  {
    "titulo": "Estação Sacomã",
    "resumo": "A Estação Sacomã é um importante terminal de transporte público em São Paulo, localizado no bairro do Ipiranga, na Zona Sul da cidade. Ela integra a Linha 2-Verde do Metrô de São Paulo com o Terminal Sacomã, que atende ao Expresso Tiradentes e a diversas linhas de ônibus municipais e intermunicipais.",
    "link": "https://wikimetrosp.miraheze.org/wiki/Esta%C3%A7%C3%A3o_Sacom%C3%A3?utm_source=wzzm.org"
  },
  {
    "titulo": "Júlio Prestes – Amador Bueno: Governador promete fim da extensão operacional da Linha 8-Diamante",
    "resumo": "A última extensão operacional da malha metroferroviária, ligando Itapevi até Amador Bueno, está com os dias contados. O governo do estado deverá promover investimentos para acabar com a baldeação obrigatória em Itapevi.",
    "link": "https://www.metrocptm.com.br/julio-prestes-amador-bueno-governador-promete-fim-da-extensao-operacional-da-linha-8-diamante/?utm_source=wzzm.org"
  },
  {
    "titulo": "Trem Intercidades para Sorocaba terá custo de R$ 11,9 bilhões; veja o orçamento completo ",
    "resumo": "Projeto de trens expressos deverá ser construído em oito anos. Maiores investimentos previstos estão focados em viadutos e movimentação de terra devido ao novo traçado.",
    "link": "https://www.metrocptm.com.br/trem-intercidades-para-sorocaba-tera-custo-de-r-119-bilhoes-veja-o-orcamento-completo/?utm_source=wzzm.org"
  }
]
