[
  {
    "titulo": "TIC Sorocaba terá viaduto de 2 km na Lapa e super túnel em Alumínio ",
    "subtitulo": "Projeto do trem regional contemplará 33 viadutos, oito túneis e três pontes ao longo de seu trajeto. A extensão linear de todas as obras de arte previstas é de 12,3 km ",
    "texto": "O TIC Eixo Oeste, serviço de trens regionais ligando São Paulo à Sorocaba, se destaca não só por ser uma rota expressa entre as duas regiões metropolitanas, mas também pela sua complexidade técnica e de engenharia.\nO site realizou um levantamento das principais obras de arte do projeto, que deverá contar com 89,6 quilômetros de extensão. Destes trechos, quase metade será de vias novas e 30% serão das vias originais da Estrada de Ferro Sorocabana.\nVeja na fonte original: Metro CPTM\n\nCARLOS, Jean. TIC Sorocaba terá viaduto de 2 km na Lapa e super túnel em Alumínio. Metrô CPTM, São Paulo, 4 maio 2025. Disponível em: https://www.metrocptm.com.br/tic-sorocaba-tera-viaduto-de-2-km-na-lapa-e-super-tunel-em-aluminio/?utm_source=wzzm.org. Acesso em: 4 maio 2025.",
    "dataPublicacao": "2025-05-04",
    "fonte": "Metrô CPTM",
    "linkFonte": "https://www.metrocptm.com.br/tic-sorocaba-tera-viaduto-de-2-km-na-lapa-e-super-tunel-em-aluminio/?utm_source=wzzm.org",
    "videoUrl": ""
  },
  {
    "titulo": "Últimos artigos",
    "subtitulo": "Notícia 1: TIC Sorocabana",
    "texto": "O projeto TIC Eixo Oeste foi lançado e está em fase de consulta pública para avaliação inicial. O trem terá tanto novas rotas quanto trechos compartilhados com linhas existentes. Região de Sorocaba: Terá duas estações—Sorocaba e Brigadeiro Tobias—seguindo o antigo traçado da Estrada de Ferro Sorocabana antes de divergir para uma nova rota. Alumínio e Mairinque: Duas estações previstas; traçado novo, evitando interferências de carga, como a CBA. São Roque e Itapevi: Segue diretriz original com retificações de via para melhorar velocidade operacional (140 km/h). Castelo Branco: Segue paralelo à rodovia até Barueri, onde se junta à Linha 8-Diamante. Trecho compartilhado com Linha 8: Entre Antônio João e Água Branca, com estação Carapicuíba incluída no serviço parador. Obras de arte: O projeto envolve túneis, pontes e viadutos para superar obstáculos geográficos. Investimento estimado em R$11 bilhões, com 80% financiado pelo governo e o restante por meio de contraprestação ao longo de 30 anos.",
    "dataPublicacao": "2025-05-01",
    "fonte": "CARLOS, Jean. Veja em detalhes o traçado do trem entre Sorocaba e São Paulo. Metrô CPTM, 1 maio de 2025.",
    "linkFonte": "https://www.metrocptm.com.br/veja-em-detalhes-o-tracado-do-trem-entre-sorocaba-e-sao-paulo?utm_source=wzzm.org",
    "videoUrl": "https://www.youtube.com/embed/videoseries?si=LdNuq0kokywnsQNW&list=PLV7ZJuhjnlq3-_smgpaBnQzAyo77PVn0F"
  }
]
