<!-- ####### HEY, I AM THE SOURCE EDITOR! #########-->
<h1 style="color: #5e9ca0; text-align: justify;"><span style="color: #ff0000;">Aten&ccedil;&atilde;o: A p&aacute;gina solicitada n&atilde;o existe.</span></h1>
<p style="text-align: justify;" data-sourcepos="1:1-1:359">O erro <strong>404 Not Found</strong> (P&aacute;gina N&atilde;o Encontrada) &eacute;, sem d&uacute;vida, um dos c&oacute;digos de status HTTP mais comuns e reconhec&iacute;veis que os usu&aacute;rios da internet encontram. Ele faz parte da classe de erros <strong>4xx (Erros do Cliente)</strong>, o que significa que o problema &eacute; percebido como sendo do lado do navegador ou da solicita&ccedil;&atilde;o feita pelo usu&aacute;rio, e n&atilde;o do servidor em si.</p>
<h3 style="text-align: justify;" data-sourcepos="3:1-3:20">O que significa?</h3>
<p style="text-align: justify;" data-sourcepos="5:1-5:121">Quando voc&ecirc; tenta acessar uma p&aacute;gina da web, seu navegador envia uma solicita&ccedil;&atilde;o a um servidor. O erro 404 ocorre quando:</p>
<ol style="text-align: justify;" data-sourcepos="7:1-9:0">
<li data-sourcepos="7:1-7:113"><strong>O navegador consegue se conectar ao servidor.</strong> Isso &eacute; importante: o servidor est&aacute; funcionando e acess&iacute;vel.</li>
<li data-sourcepos="8:1-9:0"><strong>O servidor, no entanto, n&atilde;o consegue encontrar o recurso (p&aacute;gina, imagem, arquivo) solicitado pelo navegador.</strong></li>
</ol>
<p style="text-align: justify;" data-sourcepos="10:1-10:133">Em outras palavras, o servidor est&aacute; "online" e respondendo, mas ele n&atilde;o tem o que voc&ecirc; est&aacute; procurando no endere&ccedil;o que voc&ecirc; forneceu.</p>
<h3 style="text-align: justify;" data-sourcepos="12:1-12:29">Causas Comuns do Erro 404</h3>
<ul style="text-align: justify;" data-sourcepos="14:1-22:0">
<li data-sourcepos="14:1-14:156"><strong>URL incorreta (erro de digita&ccedil;&atilde;o):</strong> Esta &eacute; a causa mais frequente. O usu&aacute;rio digitou o endere&ccedil;o da web (URL) errado na barra de endere&ccedil;os do navegador.</li>
<li data-sourcepos="15:1-15:206"><strong>P&aacute;gina movida ou deletada:</strong> O conte&uacute;do da p&aacute;gina que voc&ecirc; est&aacute; tentando acessar foi removido do servidor ou teve seu endere&ccedil;o (URL) alterado, e n&atilde;o h&aacute; um redirecionamento configurado para o novo local.</li>
<li data-sourcepos="16:1-16:153"><strong>Link quebrado ou "morto":</strong> Um link em outro site, ou at&eacute; mesmo dentro do pr&oacute;prio site, aponta para uma p&aacute;gina que n&atilde;o existe mais ou cuja URL mudou.</li>
<li data-sourcepos="17:1-17:155"><strong>Problemas de DNS:</strong> Em alguns casos, configura&ccedil;&otilde;es incorretas do DNS podem levar o navegador a procurar a p&aacute;gina no lugar errado, resultando em um 404.</li>
<li data-sourcepos="18:1-18:131"><strong>Erro de cache do navegador:</strong> Seu navegador pode ter armazenado uma vers&atilde;o antiga da p&aacute;gina no cache que agora n&atilde;o existe mais.</li>
<li data-sourcepos="19:1-19:201"><strong>Problemas com o arquivo .htaccess:</strong> Em servidores Apache, um arquivo <code>.htaccess</code> mal configurado pode causar redirecionamentos incorretos ou impedir o acesso a certos arquivos, resultando em 404s.</li>
<li data-sourcepos="20:1-20:257"><strong>Arquivo ausente:</strong> Pode ser que um arquivo essencial para a p&aacute;gina (como uma imagem, um arquivo CSS ou JavaScript) n&atilde;o esteja mais dispon&iacute;vel no servidor, gerando um 404 para aquele recurso espec&iacute;fico, mesmo que a p&aacute;gina principal carregue parcialmente.</li>
<li data-sourcepos="21:1-22:0"><strong>V&iacute;rus ou malware:</strong> Embora menos comum, softwares maliciosos podem interferir na navega&ccedil;&atilde;o, causando redirecionamentos para p&aacute;ginas inexistentes ou impedindo o acesso correto.</li>
</ul>
<h3 style="text-align: justify;" data-sourcepos="23:1-23:40">O que acontece quando um 404 ocorre?</h3>
<p style="text-align: justify;" data-sourcepos="25:1-25:416">Geralmente, o navegador exibe uma mensagem de erro indicando que a p&aacute;gina n&atilde;o foi encontrada. Muitos sites personalizam suas p&aacute;ginas de erro 404 para torn&aacute;-las mais amig&aacute;veis, com um design que combina com o restante do site e, muitas vezes, oferecendo op&ccedil;&otilde;es como um campo de busca, links para a p&aacute;gina inicial ou outras se&ccedil;&otilde;es populares, ou at&eacute; mesmo um toque de humor para tentar diminuir a frustra&ccedil;&atilde;o do usu&aacute;rio.</p>
<h3 style="text-align: justify;" data-sourcepos="27:1-27:22">Impacto e Solu&ccedil;&otilde;es</h3>
<p style="text-align: justify;" data-sourcepos="29:1-29:14">Para usu&aacute;rios:</p>
<ul style="text-align: justify;" data-sourcepos="31:1-36:0">
<li data-sourcepos="31:1-31:98"><strong>Verifique a URL:</strong> A primeira coisa a fazer &eacute; revisar se voc&ecirc; digitou o endere&ccedil;o corretamente.</li>
<li data-sourcepos="32:1-32:72"><strong>Atualize a p&aacute;gina:</strong> &Agrave;s vezes, &eacute; um erro tempor&aacute;rio de carregamento.</li>
<li data-sourcepos="33:1-33:96"><strong>Limpe o cache e os cookies do navegador:</strong> Isso pode resolver problemas de p&aacute;ginas em cache.</li>
<li data-sourcepos="34:1-34:104"><strong>Tente novamente mais tarde:</strong> O site pode estar passando por manuten&ccedil;&atilde;o ou instabilidade tempor&aacute;ria.</li>
<li data-sourcepos="35:1-36:0"><strong>Use um mecanismo de busca:</strong> Tente pesquisar o conte&uacute;do desejado no Google ou em outro motor de busca.</li>
</ul>
<p style="text-align: justify;" data-sourcepos="37:1-37:28">Para propriet&aacute;rios de sites:</p>
<ul style="text-align: justify;" data-sourcepos="39:1-43:0">
<li data-sourcepos="39:1-39:211"><strong>Redirecionamentos 301:</strong> Se uma p&aacute;gina foi movida permanentemente, implemente um redirecionamento 301 (Moved Permanently) do URL antigo para o novo. Isso &eacute; crucial para a experi&ecirc;ncia do usu&aacute;rio e para o SEO.</li>
<li data-sourcepos="40:1-40:145"><strong>Verifique links quebrados:</strong> Utilize ferramentas para identificar e corrigir links internos e externos que apontam para p&aacute;ginas inexistentes.</li>
<li data-sourcepos="41:1-41:114"><strong>P&aacute;ginas 404 personalizadas:</strong> Crie uma p&aacute;gina 404 amig&aacute;vel e &uacute;til para guiar os usu&aacute;rios de volta ao seu site.</li>
<li data-sourcepos="42:1-43:0"><strong>Monitore erros 404:</strong> Use ferramentas de an&aacute;lise de web (como Google Search Console) para identificar quais URLs est&atilde;o gerando erros 404 no seu site, o que pode indicar problemas a serem corrigidos.</li>
</ul>
<p style="text-align: justify;" data-sourcepos="1:1-1:245">Esses c&oacute;digos s&atilde;o agrupados em classes:</p>
<ul style="text-align: justify;" data-sourcepos="3:1-8:0">
<li data-sourcepos="3:1-3:87"><strong>1xx (Informativas):</strong> Indicam que a solicita&ccedil;&atilde;o foi recebida e o processo continua.</li>
<li data-sourcepos="4:1-4:76"><strong>2xx (Sucesso):</strong> A a&ccedil;&atilde;o foi recebida, compreendida e aceita com sucesso.</li>
<li data-sourcepos="5:1-5:105"><strong>3xx (Redirecionamento):</strong> O cliente precisa tomar alguma a&ccedil;&atilde;o adicional para completar a solicita&ccedil;&atilde;o.</li>
<li data-sourcepos="6:1-6:139"><strong>4xx (Erros do Cliente):</strong> Indicam que a solicita&ccedil;&atilde;o cont&eacute;m sintaxe incorreta ou n&atilde;o pode ser atendida, sendo o erro do lado do cliente.</li>
<li data-sourcepos="7:1-8:0"><strong>5xx (Erros do Servidor):</strong> Indicam que o servidor falhou ao cumprir uma solicita&ccedil;&atilde;o aparentemente v&aacute;lida.</li>
</ul>
<p style="text-align: justify;" data-sourcepos="9:1-9:53">Aqui est&atilde;o alguns dos erros mais comuns, al&eacute;m do 404:</p>
<p style="text-align: justify;" data-sourcepos="11:1-11:27"><strong>Erros do Cliente (4xx):</strong></p>
<ul style="text-align: justify;" data-sourcepos="13:1-24:0">
<li data-sourcepos="13:1-13:231"><strong>400 Bad Request (Requisi&ccedil;&atilde;o Inv&aacute;lida):</strong> O servidor n&atilde;o consegue processar a solicita&ccedil;&atilde;o devido a um erro percebido do cliente (por exemplo, sintaxe da solicita&ccedil;&atilde;o malformada, enquadramento de mensagem de solicita&ccedil;&atilde;o inv&aacute;lida).</li>
<li data-sourcepos="14:1-14:235"><strong>401 Unauthorized (N&atilde;o Autorizado):</strong> O cliente n&atilde;o tem credenciais de autentica&ccedil;&atilde;o v&aacute;lidas para o recurso solicitado. O servidor pode responder com este erro se o usu&aacute;rio tentar acessar uma p&aacute;gina que exige login e n&atilde;o est&aacute; logado.</li>
<li data-sourcepos="15:1-15:260"><strong>403 Forbidden (Proibido):</strong> O cliente n&atilde;o tem permiss&atilde;o de acesso ao conte&uacute;do. Ao contr&aacute;rio do 401, a identidade do cliente &eacute; conhecida pelo servidor, mas ele se recusa a fornecer o recurso solicitado (por exemplo, tentativa de acessar uma pasta restrita).</li>
<li data-sourcepos="16:1-16:172"><strong>405 Method Not Allowed (M&eacute;todo N&atilde;o Permitido):</strong> O m&eacute;todo HTTP usado na solicita&ccedil;&atilde;o (GET, POST, PUT, DELETE, etc.) n&atilde;o &eacute; permitido para o recurso identificado pela URL.</li>
<li data-sourcepos="17:1-17:129"><strong>408 Request Timeout (Tempo Limite da Requisi&ccedil;&atilde;o):</strong> O servidor esgotou o tempo de espera pela requisi&ccedil;&atilde;o completa do cliente.</li>
<li data-sourcepos="18:1-18:198"><strong>409 Conflict (Conflito):</strong> A requisi&ccedil;&atilde;o n&atilde;o p&ocirc;de ser completada devido a um conflito com o estado atual do recurso (por exemplo, tentar atualizar um arquivo que foi modificado por outra pessoa).</li>
<li data-sourcepos="19:1-19:240"><strong>410 Gone (Recurso Removido):</strong> Indica que o recurso solicitado n&atilde;o est&aacute; mais dispon&iacute;vel no servidor e que essa condi&ccedil;&atilde;o provavelmente &eacute; permanente. &Eacute; semelhante ao 404, mas com a indica&ccedil;&atilde;o de que o recurso foi intencionalmente removido.</li>
<li data-sourcepos="20:1-20:141"><strong>413 Payload Too Large (Carga &Uacute;til Muito Grande):</strong> A requisi&ccedil;&atilde;o do cliente &eacute; maior do que o servidor est&aacute; disposto ou consegue processar.</li>
<li data-sourcepos="21:1-21:142"><strong>414 URI Too Long (URI Muito Longa):</strong> A URI (Uniform Resource Identifier) solicitada pelo cliente &eacute; muito longa para o servidor processar.</li>
<li data-sourcepos="22:1-22:120"><strong>415 Unsupported Media Type (Tipo de M&iacute;dia N&atilde;o Suportado):</strong> O servidor n&atilde;o suporta o formato da m&iacute;dia da requisi&ccedil;&atilde;o.</li>
<li data-sourcepos="23:1-24:0"><strong>429 Too Many Requests (Muitas Requisi&ccedil;&otilde;es):</strong> O cliente enviou muitas requisi&ccedil;&otilde;es em um determinado per&iacute;odo de tempo (limita&ccedil;&atilde;o de taxa).</li>
</ul>
<p style="text-align: justify;" data-sourcepos="25:1-25:28"><strong>Erros do Servidor (5xx):</strong></p>
<ul style="text-align: justify;" data-sourcepos="27:1-33:0">
<li data-sourcepos="27:1-27:297"><strong>500 Internal Server Error (Erro Interno do Servidor):</strong> Um erro gen&eacute;rico que indica que o servidor encontrou uma condi&ccedil;&atilde;o inesperada que o impediu de atender &agrave; solicita&ccedil;&atilde;o. &Eacute; um dos erros mais comuns do lado do servidor e pode ter v&aacute;rias causas (erros de c&oacute;digo, configura&ccedil;&atilde;o incorreta, etc.).</li>
<li data-sourcepos="28:1-28:124"><strong>501 Not Implemented (N&atilde;o Implementado):</strong> O servidor n&atilde;o suporta a funcionalidade necess&aacute;ria para atender &agrave; solicita&ccedil;&atilde;o.</li>
<li data-sourcepos="29:1-29:140"><strong>502 Bad Gateway (Gateway Inv&aacute;lido):</strong> O servidor, ao atuar como um gateway ou proxy, recebeu uma resposta inv&aacute;lida do servidor upstream.</li>
<li data-sourcepos="30:1-30:188"><strong>503 Service Unavailable (Servi&ccedil;o Indispon&iacute;vel):</strong> O servidor n&atilde;o est&aacute; apto a lidar com a solicita&ccedil;&atilde;o no momento, geralmente devido a sobrecarga ou manuten&ccedil;&atilde;o do servidor. &Eacute; tempor&aacute;rio.</li>
<li data-sourcepos="31:1-31:154"><strong>504 Gateway Timeout (Tempo Limite do Gateway):</strong> O servidor, ao atuar como um gateway ou proxy, n&atilde;o recebeu uma resposta a tempo do servidor upstream.</li>
<li data-sourcepos="32:1-33:0"><strong>505 HTTP Version Not Supported (Vers&atilde;o HTTP N&atilde;o Suportada):</strong> O servidor n&atilde;o suporta a vers&atilde;o do protocolo HTTP usada na requisi&ccedil;&atilde;o.</li>
</ul>
<p style="text-align: justify;" data-sourcepos="34:1-34:78">Al&eacute;m dos c&oacute;digos HTTP, podem ocorrer outros tipos de erros no navegador, como:</p>
<ul style="text-align: justify;" data-sourcepos="36:1-42:0">
<li data-sourcepos="36:1-36:195"><strong>Erros de Conex&atilde;o de Rede:</strong> O navegador n&atilde;o consegue estabelecer uma conex&atilde;o com o servidor. Isso pode ser devido a problemas com a internet do usu&aacute;rio, firewall, ou o servidor estar offline.</li>
<li data-sourcepos="37:1-37:196"><strong>Erros de DNS:</strong> O navegador n&atilde;o consegue resolver o nome do dom&iacute;nio (URL) em um endere&ccedil;o IP. Isso pode ser causado por problemas com o provedor de DNS do usu&aacute;rio ou com o servidor DNS do site.</li>
<li data-sourcepos="38:1-38:164"><strong>Erros de Certificado SSL/TLS:</strong> Quando o navegador detecta um problema com o certificado de seguran&ccedil;a do site (HTTPS), como um certificado expirado ou inv&aacute;lido.</li>
<li data-sourcepos="39:1-39:183"><strong>Conte&uacute;do Misto (Mixed Content):</strong> Ocorre quando uma p&aacute;gina HTTPS tenta carregar recursos (imagens, scripts, CSS) de fontes HTTP, o que pode gerar avisos de seguran&ccedil;a no navegador.</li>
<li data-sourcepos="40:1-40:149"><strong>Erros de JavaScript:</strong> Falhas na execu&ccedil;&atilde;o de scripts JavaScript podem impedir o carregamento correto da p&aacute;gina ou de funcionalidades interativas.</li>
<li data-sourcepos="41:1-42:0"><strong>Erros de Carregamento de Recurso (Imagens, CSS, etc.):</strong> Um arquivo de imagem, folha de estilo (CSS) ou script n&atilde;o p&ocirc;de ser carregado, resultando em um layout quebrado ou funcionalidades ausentes.</li>
</ul>
<p style="text-align: justify;">Entre em contato com a WZZM para solicitar informa&ccedil;&otilde;es sobre este erro. O e-mail de contato &eacute; nukephoenixdeveloper@gmail.com</p>
<p style="text-align: justify;"><strong>&nbsp;</strong></p>
