
<p data-sourcepos="19:1-19:32"><strong>1. Informa&ccedil;&otilde;es que Coletamos</strong></p>
<p data-sourcepos="21:1-21:70">Podemos coletar diferentes tipos de informa&ccedil;&otilde;es sobre voc&ecirc;, incluindo:</p>
<ul data-sourcepos="23:1-32:0">
<li data-sourcepos="23:1-27:0">
<p data-sourcepos="23:3-23:37"><strong>Informa&ccedil;&otilde;es de Uso e Navega&ccedil;&atilde;o:</strong></p>
<ul data-sourcepos="24:5-27:0">
<li data-sourcepos="24:5-24:283"><strong>Dados de Log:</strong> Quando voc&ecirc; visita nosso site, nossos servidores registram automaticamente informa&ccedil;&otilde;es que seu navegador envia. Isso pode incluir seu endere&ccedil;o IP, tipo de navegador, p&aacute;ginas visitadas, tempo gasto em cada p&aacute;gina, datas e horas de acesso e outras estat&iacute;sticas.</li>
<li data-sourcepos="25:5-25:433"><strong>Cookies e Tecnologias de Rastreamento:</strong> Utilizamos cookies, web beacons e tecnologias similares para coletar informa&ccedil;&otilde;es sobre sua navega&ccedil;&atilde;o no site. Cookies s&atilde;o pequenos arquivos de texto armazenados no seu dispositivo que nos ajudam a melhorar sua experi&ecirc;ncia no site, personalizar conte&uacute;do, analisar tr&aacute;fego e veicular an&uacute;ncios. Voc&ecirc; pode gerenciar suas prefer&ecirc;ncias de cookies atrav&eacute;s das configura&ccedil;&otilde;es do seu navegador.</li>
<li data-sourcepos="26:5-27:0"><strong>Informa&ccedil;&otilde;es do Dispositivo:</strong> Coletamos informa&ccedil;&otilde;es sobre o dispositivo que voc&ecirc; usa para acessar nosso site, como modelo do dispositivo, sistema operacional, identificadores &uacute;nicos do dispositivo e informa&ccedil;&otilde;es da rede m&oacute;vel.</li>
</ul>
</li>
<li data-sourcepos="28:1-32:0">
<p data-sourcepos="28:3-28:45"><strong>Informa&ccedil;&otilde;es Fornecidas Voluntariamente:</strong></p>
<ul data-sourcepos="29:5-32:0">
<li data-sourcepos="29:5-29:270"><strong>Informa&ccedil;&otilde;es de Contato:</strong> Se voc&ecirc; nos contatar atrav&eacute;s de formul&aacute;rios no site (por exemplo, formul&aacute;rio de contato, inscri&ccedil;&atilde;o em newsletter, envio de not&iacute;cias), podemos coletar seu nome, endere&ccedil;o de e-mail e qualquer outra informa&ccedil;&atilde;o que voc&ecirc; decida nos fornecer.</li>
<li data-sourcepos="30:5-30:172"><strong>Coment&aacute;rios e Conte&uacute;do Gerado pelo Usu&aacute;rio:</strong> Se nosso site permitir que voc&ecirc; deixe coment&aacute;rios ou envie conte&uacute;do, as informa&ccedil;&otilde;es que voc&ecirc; fornecer ser&atilde;o coletadas.</li>
<li data-sourcepos="31:5-32:0"><strong>Participa&ccedil;&atilde;o em Enquetes ou Pesquisas:</strong> Se voc&ecirc; participar de enquetes ou pesquisas, suas respostas podem ser coletadas.</li>
</ul>
</li>
</ul>
<p data-sourcepos="33:1-33:35"><strong>2. Como Usamos Suas Informa&ccedil;&otilde;es</strong></p>
<p data-sourcepos="35:1-35:73">Utilizamos as informa&ccedil;&otilde;es coletadas para diversas finalidades, incluindo:</p>
<ul data-sourcepos="37:1-44:0">
<li data-sourcepos="37:1-37:136"><strong>Para Fornecer e Manter Nosso Site:</strong> Operar, manter e melhorar a funcionalidade do site, garantindo o acesso ao conte&uacute;do e servi&ccedil;os.</li>
<li data-sourcepos="38:1-38:131"><strong>Para Personalizar Sua Experi&ecirc;ncia:</strong> Adaptar o conte&uacute;do e as ofertas de not&iacute;cias &agrave;s suas prefer&ecirc;ncias e hist&oacute;rico de navega&ccedil;&atilde;o.</li>
<li data-sourcepos="39:1-39:189"><strong>Para An&aacute;lise e Melhoria:</strong> Entender como os usu&aacute;rios interagem com nosso site, identificar tend&ecirc;ncias, solucionar problemas t&eacute;cnicos e melhorar a qualidade do nosso conte&uacute;do e servi&ccedil;os.</li>
<li data-sourcepos="40:1-40:179"><strong>Para Comunica&ccedil;&atilde;o:</strong> Responder &agrave;s suas perguntas, fornecer suporte ao cliente e enviar newsletters, atualiza&ccedil;&otilde;es e informa&ccedil;&otilde;es relevantes (se voc&ecirc; tiver optado por receb&ecirc;-las).</li>
<li data-sourcepos="41:1-41:230"><strong>Para Publicidade e Marketing:</strong> Exibir an&uacute;ncios relevantes e personalizados, tanto em nosso site quanto em plataformas de terceiros. Isso pode incluir o uso de informa&ccedil;&otilde;es coletadas por cookies para direcionamento de an&uacute;ncios.</li>
<li data-sourcepos="42:1-42:127"><strong>Para Seguran&ccedil;a:</strong> Proteger a seguran&ccedil;a e a integridade do nosso site e prevenir atividades fraudulentas ou n&atilde;o autorizadas.</li>
<li data-sourcepos="43:1-44:0"><strong>Para Cumprimento Legal:</strong> Cumprir com obriga&ccedil;&otilde;es legais, regulat&oacute;rias e solicita&ccedil;&otilde;es governamentais.</li>
</ul>
<p data-sourcepos="45:1-45:37"><strong>3. Divulga&ccedil;&atilde;o de Suas Informa&ccedil;&otilde;es</strong></p>
<p data-sourcepos="47:1-47:81">Podemos compartilhar suas informa&ccedil;&otilde;es com terceiros nas seguintes circunst&acirc;ncias:</p>
<ul data-sourcepos="49:1-58:0">
<li data-sourcepos="49:1-49:390"><strong>Provedores de Servi&ccedil;os:</strong> Podemos compartilhar informa&ccedil;&otilde;es com empresas e indiv&iacute;duos que prestam servi&ccedil;os em nosso nome (por exemplo, hospedagem de sites, an&aacute;lise de dados, servi&ccedil;os de publicidade, suporte ao cliente). Esses provedores t&ecirc;m acesso &agrave;s suas informa&ccedil;&otilde;es apenas para realizar tarefas em nosso nome e s&atilde;o obrigados a n&atilde;o divulg&aacute;-las ou us&aacute;-las para qualquer outra finalidade.</li>
<li data-sourcepos="50:1-50:193"><strong>Parceiros de Publicidade:</strong> Podemos compartilhar informa&ccedil;&otilde;es com parceiros de publicidade e redes de an&uacute;ncios para exibir an&uacute;ncios relevantes e medir a efic&aacute;cia das campanhas publicit&aacute;rias.</li>
<li data-sourcepos="51:1-56:59"><strong>Para Cumprimento da Lei e Prote&ccedil;&atilde;o de Direitos:</strong> <span class="citation-16">Podemos divulgar suas informa&ccedil;&otilde;es se acreditarmos, de boa-f&eacute;, que a divulga&ccedil;&atilde;o &eacute; necess&aacute;ria para: </span>
<ul data-sourcepos="52:5-56:59">
<ul data-sourcepos="52:5-56:59">
<li data-sourcepos="52:5-52:34"><span class="citation-16">Cumprir uma obriga&ccedil;&atilde;o legal.</span></li>
</ul>
</ul>
<ul data-sourcepos="52:5-56:59">
<ul data-sourcepos="52:5-56:59">
<li data-sourcepos="53:5-53:72"><span class="citation-16 citation-end-16">Proteger</span> e defender os direitos ou propriedade da WZZM.org.</li>
<li data-sourcepos="54:5-54:91">Prevenir <span class="citation-15">ou investigar poss&iacute;veis irregularidades </span><span class="citation-14 citation-15">relacionadas ao Servi&ccedil;o.</span></li>
</ul>
</ul>
<ul data-sourcepos="52:5-56:59">
<ul data-sourcepos="52:5-56:59">
<li data-sourcepos="55:5-55:73"><span class="citation-14 citation-15">Proteger a seguran&ccedil;a pessoal dos usu&aacute;rios do Servi&ccedil;o ou do p&uacute;blico.</span></li>
</ul>
</ul>
<ul data-sourcepos="52:5-56:59">
<li data-sourcepos="56:5-56:59"><span class="citation-14 citation-15 citation-end-15">Proteger</span><span class="citation-14 citation-end-14"> contra responsabilidade legal.</span></li>
</ul>
</li>
<li data-sourcepos="57:1-58:0"><strong>Transfer&ecirc;ncias de Neg&oacute;cios:</strong> Em caso de fus&atilde;o, aquisi&ccedil;&atilde;o, venda de ativos ou insolv&ecirc;ncia, suas informa&ccedil;&otilde;es pessoais podem ser transferidas como parte dos ativos da empresa.</li>
</ul>
<p data-sourcepos="59:1-59:30"><strong>4. Cookies e Suas Escolhas</strong></p>
<p data-sourcepos="61:1-61:366">Conforme mencionado, WZZM.org utiliza cookies. Voc&ecirc; tem o direito de decidir se aceita ou rejeita cookies. Voc&ecirc; pode configurar ou redefinir seu navegador <span class="citation-13 citation-end-13">para recusar todos os cookies ou para indicar quando um cookie est&aacute; sendo enviado. No entanto, se voc&ecirc; optar por recusar cookies, algumas partes</span> do nosso <span class="citation-12">site podem n&atilde;o funcionar corretamente.</span></p>
<p data-sourcepos="63:1-63:36"><strong><span class="citation-12">5. Links para Sites de Terceiros</span></strong></p>
<p data-sourcepos="65:1-65:442"><span class="citation-12">Nosso site pode conter </span><span class="citation-11 citation-12 citation-end-12">links para outros sites que n&atilde;o s&atilde;o</span><span class="citation-11 citation-end-11"> operados por n&oacute;s. Se voc&ecirc; clicar em um link de terceiros, ser&aacute; direcionado ao site desse terceiro. Aconselhamos vivamente que revise</span> <span class="citation-10">a Pol&iacute;tica de Privacidade de cada site que voc&ecirc; visita. </span><span class="citation-9 citation-10 citation-end-10">N&atilde;o temos controle e n&atilde;o assumimos responsabilidade pelo conte&uacute;do, pol&iacute;ticas de privacidade ou pr&aacute;ticas</span><span class="citation-9 citation-end-9"> de quaisquer sites ou servi&ccedil;os de</span> terceiros.</p>
<p data-sourcepos="67:1-67:26"><strong>6. Seguran&ccedil;a dos Dados</strong></p>
<p data-sourcepos="69:1-69:528">A seguran&ccedil;a das suas informa&ccedil;&otilde;es <span class="citation-8">&eacute; importante para n&oacute;s. Implementamos medidas de seguran&ccedil;a razo&aacute;veis para proteger suas </span><span class="citation-7 citation-8 citation-end-8">informa&ccedil;&otilde;es pessoais contra acesso n&atilde;o autorizado,</span><span class="citation-7"> altera&ccedil;&atilde;o, divulga&ccedil;&atilde;o ou destrui&ccedil;&atilde;o. No entanto, lembre-se que nenhum m&eacute;todo de transmiss</span><span class="citation-6 citation-7 citation-end-7">&atilde;o pela Internet</span><span class="citation-6"> ou m&eacute;todo de armazenamento eletr&ocirc;nico &eacute; 100% seguro. </span><span class="citation-5 citation-6 citation-end-6">Embora nos esforcemos para usar meios comercialmente aceit&aacute;veis para proteger</span><span class="citation-5 citation-end-5"> suas informa&ccedil;&otilde;es, n&atilde;o podemos garantir sua seguran&ccedil;a</span> absoluta.</p>
<p data-sourcepos="71:1-71:30"><strong>7. Privacidade de Crian&ccedil;as</strong></p>
<p data-sourcepos="73:1-73:516">Nosso site <span class="citation-4 citation-end-4">n&atilde;o se destina a menores de 13 anos. N&atilde;o coletamos intencionalmente informa&ccedil;&otilde;es de identifica&ccedil;&atilde;o pessoal de crian&ccedil;as menores</span> de 13 anos. Se voc&ecirc; &eacute; pai/m&atilde;e ou respons&aacute;vel e tem conhecimento de que seu filho nos forneceu <span class="citation-3 citation-end-3">informa&ccedil;&otilde;es pessoais, entre em contato conosco. Se tomarmos conhecimento de que coletamos informa&ccedil;&otilde;es pessoais de uma crian&ccedil;a menor de 13 anos sem verifica&ccedil;&atilde;o do consentimento dos pais, tomaremos medidas para remover essas informa&ccedil;&otilde;es de nossos</span> servidores.</p>
<p data-sourcepos="75:1-75:43"><strong>8. Suas Op&ccedil;&otilde;es de Privacidade (Opt-Out)</strong></p>
<ul data-sourcepos="77:1-79:0">
<li data-sourcepos="77:1-77:242"><strong>Newsletters e Comunica&ccedil;&otilde;es de Marketing:</strong> Se voc&ecirc; se inscreveu em nossas newsletters ou outras comunica&ccedil;&otilde;es de marketing, voc&ecirc; pode optar por n&atilde;o receb&ecirc;-las seguindo as instru&ccedil;&otilde;es de "cancelamento de inscri&ccedil;&atilde;o" fornecidas em cada e-mail.</li>
<li data-sourcepos="78:1-79:0"><strong>Publicidade Personalizada:</strong> Voc&ecirc; pode ter op&ccedil;&otilde;es para controlar a publicidade personalizada atrav&eacute;s das configura&ccedil;&otilde;es do seu navegador ou de ferramentas de opt-out de redes de publicidade de terceiros.</li>
</ul>
<p data-sourcepos="80:1-80:55"><strong>9. <span class="citation-2">Altera&ccedil;&otilde;es a Esta Pol&iacute;tica de Privacidade</span></strong></p>
<p data-sourcepos="82:1-82:397"><span class="citation-2 citation-end-2">Podemos atualizar nossa Pol&iacute;tica de Privacidade periodicamente. Notificaremos voc&ecirc; sobre</span> <span class="citation-1">quaisquer altera&ccedil;&otilde;es publicando a nova Pol&iacute;tica de Privacidade nesta p&aacute;gina. Aconselhamos que voc&ecirc; revise </span><span class="citation-0 citation-1 citation-end-1">esta Pol&iacute;tica de Privacidade periodicamente para quaisquer altera&ccedil;&otilde;es. As altera&ccedil;&otilde;es</span><span class="citation-0 citation-end-0"> a esta Pol&iacute;tica de Privacidade s&atilde;o eficazes quando s&atilde;o publicadas nesta p&aacute;gina.</span></p>
<p data-sourcepos="84:1-84:20"><strong>10. Fale Conosco</strong></p>
<p data-sourcepos="86:1-86:100">Se voc&ecirc; tiver alguma d&uacute;vida sobre esta Pol&iacute;tica de Privacidade, entre em contato conosco atrav&eacute;s de:</p>
<p data-sourcepos="88:1-90:31">[Endere&ccedil;o de E-mail de Contato da WZZM.org] [Endere&ccedil;o F&iacute;sico (Opcional, mas recomendado para conformidade)] [N&uacute;mero de Telefone (Opcional)]</p>
<hr data-sourcepos="92:1-92:3" />
<p data-sourcepos="94:1-94:60"><strong>Pontos Importantes para a WZZM.org Considerar e Adaptar:</strong></p>
<ul data-sourcepos="96:1-103:0">
<li data-sourcepos="96:1-96:239"><strong>Jurisdi&ccedil;&atilde;o:</strong> Como WZZM.org &eacute; dos EUA, as leis estaduais (como a CCPA da Calif&oacute;rnia) e federais dos EUA s&atilde;o relevantes. Se houver usu&aacute;rios na Europa, o GDPR tamb&eacute;m se aplica. <strong>&Eacute; crucial identificar quais leis se aplicam ao seu site.</strong></li>
<li data-sourcepos="97:1-97:241"><strong>Dados de Registro:</strong> Se o site tiver &aacute;reas de login, f&oacute;runs ou sistemas de coment&aacute;rios onde os usu&aacute;rios criam contas, voc&ecirc; precisa detalhar explicitamente quais informa&ccedil;&otilde;es s&atilde;o coletadas durante o registro e como s&atilde;o usadas e protegidas.</li>
<li data-sourcepos="98:1-98:177"><strong>Compartilhamento de Dados:</strong> Seja o mais transparente poss&iacute;vel sobre com quem as informa&ccedil;&otilde;es s&atilde;o compartilhadas (ex: Google Analytics, parceiros de publicidade espec&iacute;ficos).</li>
<li data-sourcepos="99:1-99:245"><strong>Direitos do Usu&aacute;rio:</strong> Muitas leis de privacidade (como GDPR e CCPA) concedem aos usu&aacute;rios direitos espec&iacute;ficos sobre seus dados (acesso, retifica&ccedil;&atilde;o, exclus&atilde;o, etc.). Sua pol&iacute;tica deve explicar como os usu&aacute;rios podem exercer esses direitos.</li>
<li data-sourcepos="100:1-100:188"><strong>Detalhes sobre Cookies:</strong> Uma se&ccedil;&atilde;o mais detalhada sobre os tipos de cookies usados (essenciais, de desempenho, de publicidade) e como os usu&aacute;rios podem control&aacute;-los &eacute; uma boa pr&aacute;tica.</li>
<li data-sourcepos="101:1-101:247"><strong>Ferramentas de Gerenciamento de Consentimento (CMP):</strong> Para sites que se enquadram no GDPR ou em outras leis que exigem consentimento expl&iacute;cito para cookies n&atilde;o essenciais, a implementa&ccedil;&atilde;o de um CMP (Consent Management Platform) &eacute; fundamental.</li>
<li data-sourcepos="102:1-103:0"><strong>Frequ&ecirc;ncia de Atualiza&ccedil;&atilde;o:</strong> Defina uma frequ&ecirc;ncia para revisar e atualizar sua pol&iacute;tica de privacidade.</li>
</ul>
